using System.Diagnostics;
using Tyuiu.GamaleevaYuA.Sprint7.Project.V11.Lib;
using static Microsoft.ApplicationInsights.MetricDimensionNames.TelemetryContext;
namespace Tyuiu.GamaleevaYuA.Sprint7.Project.V11.Test
{
    [TestClass]
    public sealed class DataServiceTest
    {
        [TestMethod]

        public void ValidSortNumbersAscending()
        {
            DataService ds = new DataService();
            string[,] array = { {"0001", "Обломов", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567890", "г. Тюмень, ул. Мельникайте 42", "25000"  },
            {"0002", "Порфирьев", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567891", "г. Тюмень, ул. Мельникайте 42", "30000"  }, 
            {"0003", "Раскольников", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567892", "г. Тюмень, ул. Мельникайте 42", "27000"  },
            {"0004", "Солженицын", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567893", "г. Тюмень, ул. Мельникайте 42", "35000"  },
            {"0005", "Ключников", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567894", "г. Тюмень, ул. Мельникайте 42", "29000"  }};
            int numcol = 8;
            var res = ds.SortNumbersAscending(array, 8);
            string[,] wait = { { "0001", "Обломов", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567890", "г. Тюмень, ул. Мельникайте 42", "25000" },
            {"0003", "Раскольников", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567892", "г. Тюмень, ул. Мельникайте 42", "27000"  },
            {"0005", "Ключников", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567894", "г. Тюмень, ул. Мельникайте 42", "29000"  },
            {"0002", "Порфирьев", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567891", "г. Тюмень, ул. Мельникайте 42", "30000"  },
            {"0004", "Солженицын", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567893", "г. Тюмень, ул. Мельникайте 42", "35000"  }};
            CollectionAssert.AreEqual(wait, res);

        }
        [TestMethod]
        public void ValidSortNumbersDescending()
        {
            DataService ds = new DataService();
            string[,] array = { {"0001", "Обломов", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567890", "г. Тюмень, ул. Мельникайте 42", "25000"  },
            {"0002", "Порфирьев", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567891", "г. Тюмень, ул. Мельникайте 42", "30000"  },
            {"0003", "Раскольников", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567892", "г. Тюмень, ул. Мельникайте 42", "27000"  },
            {"0004", "Солженицын", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567893", "г. Тюмень, ул. Мельникайте 42", "35000"  },
            {"0005", "Ключников", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567894", "г. Тюмень, ул. Мельникайте 42", "29000"  }};
            int numcol = 8;
            var res = ds.SortNumbersDecending(array, 8);
            string[,] wait = {
            {"0004", "Солженицын", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567893", "г. Тюмень, ул. Мельникайте 42", "35000"  },
            {"0002", "Порфирьев", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567891", "г. Тюмень, ул. Мельникайте 42", "30000"  },
            {"0005", "Ключников", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567894", "г. Тюмень, ул. Мельникайте 42", "29000"  },
             {"0003", "Раскольников", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567892", "г. Тюмень, ул. Мельникайте 42", "27000"  },
             { "0001", "Обломов", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567890", "г. Тюмень, ул. Мельникайте 42", "25000"}};

            CollectionAssert.AreEqual(wait, res);
        }
        

        
        [TestMethod]
        public void ValidGetCount()
        {
            DataService ds = new DataService();
            string[,] array = { {"0001", "Обломов", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567890", "г. Тюмень, ул. Мельникайте 42", "25000"  },
            {"0002", "Порфирьев", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567891", "г. Тюмень, ул. Мельникайте 42", "30000"  },
            {"0003", "Раскольников", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567892", "г. Тюмень, ул. Мельникайте 42", "27000"  },
            {"0004", "Солженицын", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567893", "г. Тюмень, ул. Мельникайте 42", "35000"  },
            {"0005", "Ключников", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567894", "г. Тюмень, ул. Мельникайте 42", "29000"  }};
            string res = ds.GetCount(array);
            string wait = "5";
            Assert.AreEqual(wait, res);


        }
        [TestMethod]
        public void ValidGetMax()
        {
            DataService ds = new DataService();
            string[,] array = { {"0001", "Обломов", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567890", "г. Тюмень, ул. Мельникайте 42", "25000"  },
            {"0002", "Порфирьев", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567891", "г. Тюмень, ул. Мельникайте 42", "30000"  },
            {"0003", "Раскольников", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567892", "г. Тюмень, ул. Мельникайте 42", "27000"  },
            {"0004", "Солженицын", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567893", "г. Тюмень, ул. Мельникайте 42", "35000"  },
            {"0005", "Ключников", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567894", "г. Тюмень, ул. Мельникайте 42", "29000"  }};
            string res = ds.GetMax(array);
            string wait = "35000";
            Assert.AreEqual(wait, res);

        }
        [TestMethod]
        public void ValidGetMin()
        {
            DataService ds = new DataService();
            string[,] array = { {"0001", "Обломов", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567890", "г. Тюмень, ул. Мельникайте 42", "25000"  },
            {"0002", "Порфирьев", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567891", "г. Тюмень, ул. Мельникайте 42", "30000"  },
            {"0003", "Раскольников", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567892", "г. Тюмень, ул. Мельникайте 42", "27000"  },
            {"0004", "Солженицын", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567893", "г. Тюмень, ул. Мельникайте 42", "35000"  },
            {"0005", "Ключников", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567894", "г. Тюмень, ул. Мельникайте 42", "29000"  }};
            string res = ds.GetMin(array);
            string wait = "25000";
            Assert.AreEqual(wait, res);

        }
        [TestMethod]
        public void ValidGetSum()
        {
            DataService ds = new DataService();
            string[,] array = { {"0001", "Обломов", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567890", "г. Тюмень, ул. Мельникайте 42", "25000"  },
            {"0002", "Порфирьев", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567891", "г. Тюмень, ул. Мельникайте 42", "30000"  },
            {"0003", "Раскольников", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567892", "г. Тюмень, ул. Мельникайте 42", "27000"  },
            {"0004", "Солженицын", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567893", "г. Тюмень, ул. Мельникайте 42", "35000"  },
            {"0005", "Ключников", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567894", "г. Тюмень, ул. Мельникайте 42", "29000"  }};
            string res = ds.GetSum(array);
            string wait = "146000";
            Assert.AreEqual(wait, res);
        }
        [TestMethod]
        public void ValidGetAverage()
        {
            DataService ds = new DataService();
            string[,] array = { {"0001", "Обломов", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567890", "г. Тюмень, ул. Мельникайте 42", "25000"  },
            {"0002", "Порфирьев", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567891", "г. Тюмень, ул. Мельникайте 42", "30000"  },
            {"0003", "Раскольников", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567892", "г. Тюмень, ул. Мельникайте 42", "27000"  },
            {"0004", "Солженицын", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567893", "г. Тюмень, ул. Мельникайте 42", "35000"  },
            {"0005", "Ключников", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567894", "г. Тюмень, ул. Мельникайте 42", "29000"  }};
            string res = ds.GetAverage(array);
            string wait = "29200";
            Assert.AreEqual(wait, res);


        }
        [TestMethod]
        public void ValidGetSalarys()
        {
            DataService ds = new DataService();
            string[,] array = { {"0001", "Обломов", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567890", "г. Тюмень, ул. Мельникайте 42", "25000"  },
            {"0002", "Порфирьев", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567891", "г. Тюмень, ул. Мельникайте 42", "30000"  },
            {"0003", "Раскольников", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567892", "г. Тюмень, ул. Мельникайте 42", "27000"  },
            {"0004", "Солженицын", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567893", "г. Тюмень, ул. Мельникайте 42", "35000"  },
            {"0005", "Ключников", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567894", "г. Тюмень, ул. Мельникайте 42", "29000"  }};
            int[] res = ds.GetSalarys(array);
            int[] wait = { 25000, 30000, 27000, 35000, 29000 };
            CollectionAssert.AreEqual(wait, res);

        }
        [TestMethod]
        public void ValidGetPersonsNames()
        {
            DataService ds = new DataService();
            string[,] array = { {"0001", "Обломов", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567890", "г. Тюмень, ул. Мельникайте 42", "25000"  },
            {"0002", "Порфирьев", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567891", "г. Тюмень, ул. Мельникайте 42", "30000"  },
            {"0003", "Раскольников", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567892", "г. Тюмень, ул. Мельникайте 42", "27000"  },
            {"0004", "Солженицын", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567893", "г. Тюмень, ул. Мельникайте 42", "35000"  },
            {"0005", "Ключников", "Иван", "Сергеевич", "Бухгалтер", "Бухгалтерия", "81234567894", "г. Тюмень, ул. Мельникайте 42", "29000"  }};
            string[] res = ds.GetPersonsNames(array);
            string[] wait = { "Обломов И.С.", "Порфирьев И.С.", "Раскольников И.С.", "Солженицын И.С.", "Ключников И.С." };
            CollectionAssert.AreEqual(wait, res);

        }
    }
}
